Тестовая_база_ERP_14/src/Enums/ВариантыОбособленияМатериаловВПроизводстве/ВариантыОбособленияМатериаловВПроизводстве.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыОбособленияМатериаловВПроизводстве</name>
  <enumValues>
    <name>НаправлениеДеятельности</name>
  </enumValues>
  <enumValues>
    <name>НазначениеПродукции</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНаПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ЭтапПроизводства</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Constants/ИспользоватьУправлениеПроизводством/ValueManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
//++ НЕ УТКА
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
	ПараметрыНабора.Используется = Константы.ИспользоватьУправлениеПроизводством.Получить();
	
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_ЗаказНаПроизводство", ПараметрыНабора);
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_МаршрутныйЛистПроизводства", ПараметрыНабора);
	
	ПланированиеПроизводства.ПроверитьОтключитьРегламентноеЗаданиеРасчетГрафикаПроизводства();
	
	ВариантОбособления = Константы.ВариантОбособленияМатериаловВПроизводстве.Получить();
	Если ЭтотОбъект.Значение И Не Константы.ИспользоватьУправлениеПроизводством2_2.Получить()
		И ВариантОбособления <> Перечисления.ВариантыОбособленияМатериаловВПроизводстве.НаправлениеДеятельности
		И ВариантОбособления <> Перечисления.ВариантыОбособленияМатериаловВПроизводстве.НазначениеПродукции Тогда
		
		Константы.ВариантОбособленияМатериаловВПроизводстве.Установить(
			Перечисления.ВариантыОбособленияМатериаловВПроизводстве.НазначениеПродукции);
		
	КонецЕсли;
	
	Справочники.СтруктураПредприятия.ЗаполнитьИспользуемыеМетодикиУправления();
//-- НЕ УТКА
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
